<details>
<summary>Execution result of "plan" in "dev"</summary>

```terraform

Initializing the backend...

Successfully configured the backend "local"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...

Initializing provider plugins...
- Reusing previous version of pvotal-tech/k3d from the dependency lock file
- Using previously-installed pvotal-tech/k3d v0.0.7

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k3s-cluster.k3d_cluster.k3s will be created
  + resource "k3d_cluster" "k3s" {
      + agents      = 0
      + credentials = (sensitive value)
      + id          = (known after apply)
      + image       = "rancher/k3s:v1.24.4-k3s1"
      + name        = "dev-k3d-test3"
      + network     = (known after apply)
      + servers     = 1
      + token       = (sensitive value)

      + k3d {}

      + kube_api {
          + host_port = 6443
        }

      + kubeconfig {
          + switch_current_context    = false
          + update_default_kubeconfig = false
        }

      + port {
          + container_port = 443
          + host_port      = 8443
          + node_filters   = [
              + "loadbalancer",
            ]
        }
      + port {
          + container_port = 80
          + host_port      = 8080
          + node_filters   = [
              + "loadbalancer",
            ]
        }

      + runtime {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + k3s_host    = (known after apply)
  + k3s_id      = (known after apply)
  + k3s_network = (known after apply)
```

</details>
    